
Процедура ПриОткрытии()
	ЭлементыФормы.Надпись1.Заголовок=СтрЗаменить(ЭлементыФормы.Надпись1.Заголовок, "Реквизит", РеквизитДляПроверкиОбщ);
	РеквизитыСписок=Новый Массив();
	Если НазваниеСправКонтрагенты=Неопределено тогда
		ЭлементыФормы.Надпись1.Заголовок=СтрЗаменить(ЭлементыФормы.Надпись1.Заголовок, "РегистрСправ", РегистрПроводки);
		РеквизитыСписок=СформироватьРеквизитыРегистра();	
	Иначе
		ЭлементыФормы.Надпись1.Заголовок=СтрЗаменить(ЭлементыФормы.Надпись1.Заголовок, "РегистрСправ", НазваниеСправКонтрагенты);	
		РеквизитыСписок=СформироватьРеквизитыКонтрагентов();
	КонецЕсли;
	РеквизитыСписок1=Новый СписокЗначений();
	РеквизитыСписок1.ЗагрузитьЗначения(РеквизитыСписок);
	ЭлементыФормы.ПолеВыбора1.СписокВыбора=РеквизитыСписок1;
КонецПроцедуры

Процедура ОсновныеДействияФормыЗаменить(Кнопка)
	Если ЭлементыФормы.ПолеВыбора1.Значение="" или ЭлементыФормы.ПолеВыбора1.Значение=Неопределено Тогда
		Предупреждение("Не указано поле для замены!");
		Возврат;
	КонецЕсли;
	РеквизитДляПроверкиОбщ=ЭлементыФормы.ПолеВыбора1.Значение;
	ЭтаФорма.Закрыть();
КонецПроцедуры

Процедура ОсновныеДействияФормыПропустить(Кнопка)
	РеквизитДляПроверкиОбщ=Неопределено;
	ЭтаФорма.Закрыть();
КонецПроцедуры
