
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СправочникиСписок = Новый СписокЗначений();
	Для каждого СправочникСсылка Из Метаданные.Справочники Цикл
		Элементы.ПолеВыбораСправочника.СписокВыбора.Добавить(СправочникСсылка.Имя);
	КонецЦикла; 	

КонецПроцедуры

&НаКлиенте
Процедура Заменить(Команда)
	
	Если ПолеВыбораСправочника="" или ПолеВыбораСправочника=Неопределено Тогда
		ПоказатьПредупреждение(,"Не указан справочник для замены!");
		Возврат;
	КонецЕсли;
	НазваниеСправКонтрагенты=ПолеВыбораСправочника;
	ЭтотОбъект.Закрыть(НазваниеСправКонтрагенты);

КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	НазваниеСправКонтрагенты=Неопределено;
	ЭтотОбъект.Закрыть(НазваниеСправКонтрагенты);

КонецПроцедуры