
Процедура ПолеРазделителяАвтоПодборТекста(Элемент, Текст, ТекстАвтоПодбора, СтандартнаяОбработка)
	ЭлементыФормы.ЗнакТабуляции.Значение=4;
КонецПроцедуры

Процедура ПриОткрытии()
	ЭлементыФормы.ПолеВыбораОграничителя.Значение="<пусто>";	
КонецПроцедуры

Процедура ОсновныеДействияФормыОК(Кнопка)
	Если  ЭлементыФормы.ПолеВыбораОграничителя.Значение=Неопределено Тогда
		Предупреждение("Выберите ограничитель текста!");
		Возврат;
	ИначеЕсли ЭлементыФормы.ПолеВыбораОграничителя.Значение="<пусто>" Тогда 
		ТекстИнд="";
	Иначе
		ТекстИнд=ЭлементыФормы.ПолеВыбораОграничителя.Значение;
	КонецЕсли;
	Если ЭлементыФормы.ЗнакТабуляции.Значение=0 Тогда
		Разделитель=Символы.Таб;
	ИначеЕсли ЭлементыФормы.ЗнакТабуляции.Значение=1 Тогда 
		Разделитель=";"
	ИначеЕсли ЭлементыФормы.ЗнакТабуляции.Значение=2 Тогда 
		Разделитель=","
    ИначеЕсли ЭлементыФормы.ЗнакТабуляции.Значение=3 Тогда 
		Разделитель=" "
	ИначеЕсли ЭлементыФормы.ЗнакТабуляции.Значение=4 Тогда 
		Если (ЭлементыФормы.ПолеРазделителя.Значение="") Тогда 
			Предупреждение("Введите символ разделителя!");
			Возврат;
		КонецЕсли;
		Разделитель=ЭлементыФормы.ПолеРазделителя.Значение;
	КонецЕсли; 
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);	
	Диалог.Фильтр = "Текстовый файл (*.txt)|*.txt";
	Если Диалог.Выбрать() Тогда
		ВремяНачала=ТекущаяДата();
		Если РезультатЗапроса=Неопределено Тогда
			Запрос1=Новый Запрос();
			Если Режим="Выгрузка списка проводок" Тогда
				Запрос1.Текст=ТекстЗапросаПроводки();
				Запрос1.УстановитьПараметр("ДатаНачала",ДатаНачала);
				Запрос1.УстановитьПараметр("ДатаКонца",ДатаКонца);
				Запрос1.УстановитьПараметр("Организация",Организация);
			ИначеЕсли Режим="Выгрузка списка контрагентов" Тогда
			    ЮАдр=Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента.Наименование;
				ФАдр=Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента.Наименование;
	    		Тел=Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента.Наименование;
				Факс=ПолеФаксКонтрагента();
				Запрос1.Текст=ТекстЗапросаКонтрагенты(Юадр,Фадр,Тел,Факс,ДатаНачала, ДатаКонца);
				Запрос1.УстановитьПараметр("ЮАдр",ЮАдр);
				Запрос1.УстановитьПараметр("ФАдр",Фадр);
				Запрос1.УстановитьПараметр("Тел",Тел);
				Запрос1.УстановитьПараметр("Факс",Факс);
				Запрос1.УстановитьПараметр("ДатаНачала",ДатаНачала);
				Запрос1.УстановитьПараметр("ДатаКонца",ДатаКонца);
			ИначеЕсли Режим="Выгрузка плана счетов" Тогда
			    Запрос1.Текст=ТекстЗапросаПланСчетов();
			ИначеЕсли Режим="Выгрузка журнала регистрации" Тогда
				РезультатЗапроса=Новый ТаблицаЗначений();
			    РезультатЗапроса=СформироватьЖурналыДляВыгрузки();
				Если РезультатЗапроса=Неопределено Тогда
					Возврат;
				КонецЕсли;
			Иначе
				ФормаСпр=ПолучитьФорму("ФормаСправочники");
				СправочникИмя=ФормаСпр.ЭлементыФормы.ПолеВыбораСправочника.Значение;
				ПолеСортировки=ФормаСпр.ЭлементыФормы.ПолеВыбораСортировки.Значение;
				Запрос1.Текст=ТекстЗапросаСправочники(СправочникИмя,ПолеСортировки);
			КонецЕсли; 
			Попытка
				РезультатЗапроса=Запрос1.Выполнить();
			Исключение
				Если Режим<>"Выгрузка журнала регистрации" Тогда
					Предупреждение("При выгрузке произошла ошибка!");
					Возврат;
				КонецЕсли;	
			КонецПопытки;
		КонецЕсли;
		Если Режим<>"Выгрузка журнала регистрации" тогда
			РезультатДок = РезультатЗапроса.Выбрать();
		КонецЕсли;
		Текст = Новый ЗаписьТекста(Диалог.ПолноеИмяФайла, КодировкаТекста.UTF8);
		Если Режим="Выгрузка списка проводок" Тогда
		 	ФайлПроводки(РезультатДок,Текст, ТекстИнд, Разделитель);
		ИначеЕсли Режим="Выгрузка списка контрагентов" Тогда	
			РезультатДок1 = РезультатЗапроса.Выгрузить();
			РезультатДок=Новый ТаблицаЗначений();
			РезультатДок=УдалитьПустыеКолонки(РезультатДок1);
			ФайлКонтрагенты(РезультатДок, Текст, ТекстИнд, Разделитель);
			ФлагПользователи=1;
		ИначеЕсли Режим="Выгрузка плана счетов"  Тогда
			ФайлПланСчетов(РезультатДок, Текст, ТекстИнд, Разделитель);
			ФлагПользователи=1;
		ИначеЕсли Режим="Выгрузка журнала регистрации"  Тогда
			РезультатДок=Новый ТаблицаЗначений();
			РезультатДок=РезультатЗапроса;
			ФайлЖурРег(РезультатДок, Текст, ТекстИнд, Разделитель);
			ФлагПользователи=1;
		Иначе 
			РезультатДок = РезультатЗапроса.Выгрузить();
			ФайлСправочники(РезультатДок, Текст, ТекстИнд, Разделитель);	
		КонецЕсли; 
		Текст.Закрыть();      
		Если ФлагПользователи<>0 Тогда
			ВремяКонца=ТекущаяДата();
			ВремяСекунды=ВремяКонца-ВремяНачала;
			ВремяМинуты=Цел(ВремяСекунды/60);
			ВремяЧасы=Цел(ВремяМинуты/60);
			ВремяСекунды=ВремяСекунды-ВремяЧасы*60*60-ВремяМинуты*60;
			СтрокаЗатраченоВремени="Затрачено времени: ";
			Если ВремяЧасы<>0 Тогда
				СтрокаЗатраченоВремени=СтрокаЗатраченоВремени+ВремяЧасы+" ч. ";	
			КонецЕсли; 
			Если ВремяМинуты<>0 Тогда
				СтрокаЗатраченоВремени=СтрокаЗатраченоВремени+ВремяМинуты+" мин. ";	
			КонецЕсли; 
	        СтрокаЗатраченоВремени=СтрокаЗатраченоВремени+ВремяСекунды+" с.";	
			Предупреждение("Данные выгружены в файл "+Диалог.ПолноеИмяФайла+Символы.ПС+"Количество записей: "+РезультатДок.Количество()+Символы.ПС+СтрокаЗатраченоВремени);
		КонецЕсли; 
		ЭтаФорма.Закрыть();	
	КонецЕсли;
КонецПроцедуры

Процедура ФайлПроводки(РезультатДок,Текст, ТекстИнд, Разделитель)
	ТекстЗагСумма="";
	ТекстСумма="";
	ТекстЗагСодержание="";
	ТекстСодержание="";
	ТекстСчета="";
	ТекстЗагСчета="";
	Попытка
		ТекстЗагСчета=Разделитель+ТекстИнд+"СчетДт"+ТекстИнд+Разделитель+ТекстИнд+"СчетКт"+ТекстИнд;
	Исключение
		ТекстЗагСчета=Разделитель+ТекстИнд+"Счет"+ТекстИнд+Разделитель+ТекстИнд+"ВидДвижения"+ТекстИнд;
	КонецПопытки;
	Попытка 
		ТекстЗагСумма=Разделитель+ТекстИнд+"Сумма"+ТекстИнд;
	Исключение
	КонецПопытки;
	Попытка
		ТекстЗагСодержание=Разделитель+ТекстИнд+"Содержание"+ТекстИнд;
	Исключение
	КонецПопытки;
	Строка1=ТекстИнд+"ИдентификаторПроводки|"+Строка(Формат(ДатаНачала,"ДФ=""ггггММдд"""))+"|"+Строка(Формат(ДатаКонца,"ДФ=""ггггММдд"""))+ТекстИнд
			+Разделитель+ТекстИнд+"Период"+ТекстИнд
			+ТекстЗагСчета
			+ТекстЗагСумма
			+Разделитель+ТекстИнд+"ОтветственныйПоДокументу"+ТекстИнд
			+Разделитель+ТекстИнд+"Пользователь"+ТекстИнд
			+Разделитель+ТекстИнд+"Документ"+ТекстИнд
			+Разделитель+ТекстИнд+"КонтрагентИдентификатор"+ТекстИнд
			+ТекстЗагСодержание;
	Текст.ЗаписатьСтроку(Строка1);	
	Если ФлагПользователи<>2 Тогда		
		ФлагПользователи=2;
		СФормироватьЖурналы();
	КонецЕсли;
	Если ФлагПользователи=2 Тогда 
		Пока РезультатДок.Следующий() Цикл
			Отбор=Новый Структура();
			Отбор.Вставить("Данные", РезультатДок.Регистратор);
			Пользователь=НайтиВЖурналеРег(Отбор); 
			ТекстСчета="";
			ТекстСумма="";
			ТекстСодержание="";
			Попытка
				ТекстСчета=Разделитель+ТекстИнд+РезультатДок.СчетДт+ТекстИнд+Разделитель+ТекстИнд+РезультатДок.СчетКт+ТекстИнд;
			Исключение
				ТекстСчета=Разделитель+ТекстИнд+РезультатДок.Счет+ТекстИнд+Разделитель+ТекстИнд+РезультатДок.ВидДвижения+ТекстИнд;
			КонецПопытки;
			Попытка 
				ТекстСумма=Разделитель+Строка(формат(РезультатДок.Сумма,"ЧРД="".""; ЧРГ="""""));
			Исключение
			КонецПопытки;
			Попытка
				ТекстСодержание=Разделитель+ТекстИнд+СтрЗаменить(РезультатДок.Содержание,Символы.ПС, " ")+ТекстИнд;
			Исключение
			КонецПопытки;
			Строка1=ТекстИнд+РезультатДок.РегистраторНомер+Строка(РезультатДок.НомерСтроки)+ТекстИнд
			+Разделитель+ТекстИнд+Строка(Формат(РезультатДок.Период,"ДФ=""дд.ММ.гггг"""))+ТекстИнд
			+ТекстСчета
			+ТекстСумма
			+Разделитель+ТекстИнд+РезультатДок.ОтветственныйПоДокументу+ТекстИнд
			+Разделитель+ТекстИнд+Пользователь+ТекстИнд
			+Разделитель+ТекстИнд+СтрЗаменить(Лев(РезультатДок.Документ1,Найти(РезультатДок.Документ1,РезультатДок.РегистраторНомер)-1),Символы.ПС, " ")+ТекстИнд
			+Разделитель+ТекстИнд+РезультатДок.КонтрагентИдентификатор+ТекстИнд
			+ТекстСодержание;
			Текст.ЗаписатьСтроку(Строка1);	
		КонецЦикла;	
	ИначеЕсли ФлагПользователи=1 тогда
		Пока РезультатДок.Следующий() Цикл
			ТекстСчета="";
			ТекстСумма="";
			ТекстСодержание="";
			Попытка
				ТекстСчета=Разделитель+ТекстИнд+РезультатДок.СчетДт+ТекстИнд+Разделитель+ТекстИнд+РезультатДок.СчетКт+ТекстИнд;
			Исключение
				ТекстСчета=Разделитель+ТекстИнд+РезультатДок.Счет+ТекстИнд+Разделитель+ТекстИнд+РезультатДок.ВидДвижения+ТекстИнд;
			КонецПопытки;
			Попытка 
				ТекстСумма=Разделитель+Строка(формат(РезультатДок.Сумма,"ЧРД="".""; ЧРГ="""""));
			Исключение
			КонецПопытки;
			Попытка
				ТекстСодержание=Разделитель+ТекстИнд+СтрЗаменить(РезультатДок.Содержание,Символы.ПС, " ")+ТекстИнд;
			Исключение
			КонецПопытки;
			Строка1=ТекстИнд+РезультатДок.РегистраторНомер+Строка(РезультатДок.НомерСтроки)+ТекстИнд
			+Разделитель+ТекстИнд+Строка(Формат(РезультатДок.Период,"ДФ=""дд.ММ.гггг"""))+ТекстИнд
			+ТекстСчета
			+ТекстСумма
			+Разделитель+ТекстИнд+РезультатДок.ОтветственныйПоДокументу+ТекстИнд+
			+Разделитель+ТекстИнд+ТекстИнд+
			+Разделитель+ТекстИнд+СтрЗаменить(Лев(РезультатДок.Документ1,Найти(РезультатДок.Документ1,РезультатДок.РегистраторНомер)-1),Символы.ПС, " ")+ТекстИнд
			+Разделитель+ТекстИнд+РезультатДок.КонтрагентИдентификатор+ТекстИнд
			+ТекстСодержание;
			Текст.ЗаписатьСтроку(Строка1);	
		КонецЦикла;	
	Иначе 
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ФайлКонтрагенты(РезультатДок1,Текст, ТекстИнд, Разделитель)
	ТекстЗагНаимПолное="";
	ТекстЗагИНН="";
	ТекстЗагЮрФизЛицо="";
	Если РезультатДок1.Колонки.Найти("НаименованиеПолное1")<>Неопределено Тогда
		ТекстЗагНаимПолное=Разделитель+ТекстИнд+"НаименованиеПолное"+ТекстИнд;
	КонецЕсли;
	Если РезультатДок1.Колонки.Найти("ИНН")<>Неопределено Тогда
		ТекстЗагИНН=Разделитель+ТекстИнд+"ИНН"+ТекстИнд;
	КонецЕсли;
	Если РезультатДок1.Колонки.Найти("ЮрФизЛицо")<>Неопределено Тогда
		ТекстЗагЮрФизЛицо=Разделитель+ТекстИнд+"ЮрФизЛицо"+ТекстИнд;
	КонецЕсли;
	КолвоПолей=РезультатДок1.Колонки.Количество();
	Строка1=ТекстИнд+"Идентификатор|"+Строка(Формат(ДатаНачала,"ДФ=""ггггММдд"""))+"|"+Строка(Формат(ДатаКонца,"ДФ=""ггггММдд"""))+ТекстИнд
			+Разделитель+ТекстИнд+"Наименование"+ТекстИнд
			+ТекстЗагНаимПолное
			+Разделитель+ТекстИнд+"Родитель"+ТекстИнд
			+ТекстЗагИНН
			+ТекстЗагЮрФизЛицо
			+Разделитель+ТекстИнд+"БанковскиеСчета"+ТекстИнд
			+Разделитель+ТекстИнд+"ДатаПервойПроводки"+ТекстИнд
			+Разделитель+ТекстИнд+"ДатаПоследнейПроводки"+ТекстИнд
			+Разделитель+ТекстИнд+"КолвоРазличныхДок"+ТекстИнд
			+Разделитель+ТекстИнд+"ЮридическийАдрес"+ТекстИнд
			+Разделитель+ТекстИнд+"ФактическийАдрес"+ТекстИнд
			+Разделитель+ТекстИнд+"Телефон"+ТекстИнд
			+Разделитель+ТекстИнд+"Факс"+ТекстИнд
			+Разделитель+ТекстИнд+СтрЗаменить(СтрЗаменить(НазвКИ,"_987654321","|"),"_"," ")+ТекстИнд;
	Текст.ЗаписатьСтроку(Строка1);		
	РазницаПолей=9-РезультатДок1.Колонки.Индекс(РезультатДок1.Колонки.Найти("ЮрАдрес"));
	БанкСчета=БанкСчетаКонтрагентов();
	Для каждого РезультатДок из РезультатДок1 Цикл	
		СтрокаСчета="";
		СтрукПоиск=Новый Структура();
		СтрукПоиск.Вставить("Идентификатор", РезультатДок.Идентификатор);
		Пока БанкСчета.НайтиСледующий(СтрукПоиск) Цикл
			СтрокаСчета=СтрокаСчета+БанкСчета.НомерСчета+"|";	
		КонецЦикла;	
		СтрокаСчета=Лев(СтрокаСчета,СтрДлина(СтрокаСчета)-1);
		СтрокаКИ="";       
		Счетчик=13-РазницаПолей;
		Пока Счетчик<КолвоПолей Цикл
			СтрокаКИ=СтрокаКИ+СтрЗаменить(РезультатДок[Счетчик],Символы.ПС, " ")+"|";
			Счетчик=Счетчик+1;
		КонецЦикла;
		ТекстНаимПолное="";
		ТекстИНН="";
		ТекстЮрФизЛицо="";
		Если РезультатДок1.Колонки.Найти("НаименованиеПолное1")<>Неопределено Тогда
			ТекстНаимПолное=Разделитель+ТекстИнд+СтрЗаменить(РезультатДок.Наименование,Символы.ПС, " ")+ТекстИнд;
		КонецЕсли;
		Если РезультатДок1.Колонки.Найти("ИНН")<>Неопределено Тогда
			ТекстИНН=Разделитель+ТекстИнд+РезультатДок.ИНН+ТекстИнд;
		КонецЕсли;
		Если РезультатДок1.Колонки.Найти("ЮрФизЛицо")<>Неопределено Тогда
			ТекстЮрФизЛицо=Разделитель+ТекстИнд+РезультатДок.ЮрФизЛицо+ТекстИнд;
		КонецЕсли;
		Строка1=ТекстИнд+РезультатДок.Идентификатор+ТекстИнд
		+Разделитель+ТекстИнд+СтрЗаменить(РезультатДок.Наименование,Символы.ПС, " ")+ТекстИнд
		+ТекстНаимПолное
		+Разделитель+ТекстИнд+СтрЗаменить(РезультатДок.Родитель,Символы.ПС, " ")+ТекстИнд
		+ТекстИНН
		+ТекстЮрФизЛицо
		+Разделитель+ТекстИнд+СтрокаСчета+ТекстИнд
		+Разделитель+ТекстИнд+Строка(Формат(РезультатДок.ДатаПервойПроводки,"ДФ=""дд.ММ.гггг"""))+ТекстИнд
		+Разделитель+ТекстИнд+Строка(Формат(РезультатДок.ДатаПоследнейПроводки,"ДФ=""дд.ММ.гггг"""))+ТекстИнд
		+Разделитель+ТекстИнд+Строка(РезультатДок.КолвоРазличныхДок)+ТекстИнд
		+Разделитель+ТекстИнд+СокрП(СтрЗаменить(РезультатДок.ЮрАдрес,Символы.ПС, " "))+ТекстИнд
		+Разделитель+ТекстИнд+СокрП(СтрЗаменить(РезультатДок.ФактАдрес,Символы.ПС, " "))+ТекстИнд
		+Разделитель+ТекстИнд+СокрП(СтрЗаменить(РезультатДок.Тел,Символы.ПС, " "))+ТекстИнд
		+Разделитель+ТекстИнд+СокрП(СтрЗаменить(РезультатДок.Факс1,Символы.ПС, " "))+ТекстИнд
		+Разделитель+ТекстИнд+СтрокаКИ+ТекстИнд;
		Текст.ЗаписатьСтроку(Строка1);	
	КонецЦикла;	
КонецПроцедуры
	
Процедура ФайлПланСчетов(РезультатДок,Текст, ТекстИнд, Разделитель)
	Строка1=ТекстИнд+"Код"+ТекстИнд
			+Разделитель+ТекстИнд+"Наименование"+ТекстИнд;
	Текст.ЗаписатьСтроку(Строка1);	
	Пока РезультатДок.Следующий() Цикл	
		Строка1=ТекстИнд+РезультатДок.Код+ТекстИнд
		+Разделитель+ТекстИнд+РезультатДок.Наименование+ТекстИнд;
		Текст.ЗаписатьСтроку(Строка1);	
	КонецЦикла;	
КонецПроцедуры


Процедура ФайлЖурРег(РезультатДок,Текст, ТекстИнд, Разделитель)
	Строка1="";
	Для каждого Колонка1 Из РезультатДок.Колонки Цикл
		Если Колонка1.Заголовок<>"" Тогда
			Строка1=Строка1+ТекстИнд+Колонка1.Заголовок+ТекстИнд+Разделитель; 
		Иначе
			Строка1=Строка1+ТекстИнд+Колонка1.Имя+ТекстИнд+Разделитель; 
		КонецЕсли;
	КонецЦикла; 
    Текст.ЗаписатьСтроку(Лев(Строка1,СтрДлина(Строка1)-1));
	Для каждого СтрокаЖурнала из РезультатДок Цикл	
		Строка1="";
		Строка1=Строка1+ТекстИнд+Строка(Формат(СтрокаЖурнала[0],"ДФ=""дд.ММ.гггг ЧЧ:мм:сс"""))+ТекстИнд+Разделитель;
		Для Счетчик=1 По РезультатДок.Колонки.Количество()-1  Цикл
			Строка1=Строка1+ТекстИнд+СтрокаЖурнала[Счетчик]+ТекстИнд+Разделитель;		
		КонецЦикла;
		Текст.ЗаписатьСтроку(Лев(Строка1,СтрДлина(Строка1)-1));
	КонецЦикла;	
КонецПроцедуры

Процедура ФайлСправочники(РезультатДок,Текст, ТекстИнд, Разделитель)
	Строка1="";
	Для каждого Колонка  Из РезультатДок.Колонки  Цикл
		Строка1=Строка1+ТекстИнд+Колонка.Имя+ТекстИнд+Разделитель;
	КонецЦикла;
	Строка1=Лев(Строка1, СтрДлина(Строка1)-1);
	Текст.ЗаписатьСтроку(Строка1);
	Для каждого СтрокаТабл Из РезультатДок Цикл
		ИндексКол=0;
		Строка1="";
		Пока ИндексКол<РезультатДок.Колонки.Количество() Цикл
		 	Строка1=Строка1+ТекстИнд+СтрокаТабл[ИндексКол]+ТекстИнд+Разделитель;
			ИндексКол=ИндексКол+1;
		КонецЦикла; 
		Строка1=Лев(Строка1, СтрДлина(Строка1)-1);
	    Текст.ЗаписатьСтроку(Строка1);
	КонецЦикла; 
	ФлагПользователи=1;
КонецПроцедуры

 