
Процедура ПриОткрытии()
	ФлагЗакрытия=Истина;
	СправочникиСписок=Новый СписокЗначений();
	Для каждого СправочникСсылка Из Метаданные.Справочники Цикл
		СправочникиСписок.Добавить(СправочникСсылка.Имя);
	КонецЦикла; 	
	ЭлементыФормы.ПолеВыбораСправочника.СписокВыбора=СправочникиСписок;
КонецПроцедуры

Процедура ПолеВыбораСправочникаПриИзменении(Элемент)
	РеквизитыСписок=Новый СписокЗначений();
	РеквизитыСписок1=Новый СписокЗначений();
	МетаданныеСправочника=Метаданные.Справочники.Найти(ЭлементыФормы.ПолеВыбораСправочника.Значение);
	Для каждого РеквизитСсылка Из МетаданныеСправочника.СтандартныеРеквизиты Цикл
		РеквизитыСписок.Добавить(РеквизитСсылка.Имя);	
	КонецЦикла;
	РеквизитыСписок.СортироватьПоЗначению();
	Для каждого РеквизитСсылка Из МетаданныеСправочника.Реквизиты Цикл
		РеквизитыСписок.Добавить(РеквизитСсылка.Имя);	
	КонецЦикла; 
	РеквизитыСписок1.ЗагрузитьЗначения(РеквизитыСписок.ВыгрузитьЗначения());
	ЭлементыФормы.ПолеСпискаРеквизитов.Значение=РеквизитыСписок;
    ЭлементыФормы.ПолеВыбораСортировки.СписокВыбора=РеквизитыСписок1;
	Если РеквизитыСписок.НайтиПоЗначению("Код")<>Неопределено Тогда
		ЭлементыФормы.ПолеВыбораСортировки.Значение="Код";
	Иначе
		ЭлементыФормы.ПолеВыбораСортировки.Значение="Наименование";
	КонецЕсли; 		
	РезультатЗапроса=Неопределено;
КонецПроцедуры

Процедура КоманднаяПанель2ВывестиСписок(Кнопка)
	ОтмеченныеРеквизиты=Новый Массив();
	Для каждого Реквизит Из ЭлементыФормы.ПолеСпискаРеквизитов.Значение Цикл
		Если Реквизит.Пометка Тогда
			ОтмеченныеРеквизиты.Добавить(Реквизит.Значение)	
		КонецЕсли;
	КонецЦикла;
	Если ОтмеченныеРеквизиты.Количество()=0 Тогда
		Предупреждение("Не отмечено ни одного реквизита!");
		Возврат;
	КонецЕсли; 
	Запрос1=Новый Запрос();
	Запрос1.Текст=ТекстЗапросаСправочники(ЭлементыФормы.ПолеВыбораСправочника.Значение, ЭлементыФормы.ПолеВыбораСортировки.Значение);
	Попытка
		РезультатЗапроса= Запрос1.Выполнить();
	Исключение
		ТекстОшибки=ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если Найти(ТекстОшибки,"Недопустимое поле для упорядочивания")<>0 Тогда
			Предупреждение("Невозможно сортировать список по выбранному реквизиту."+Символы.ПС+"Выберите другой реквизит для сортировки."); 
		КонецЕсли;
		Возврат;
	КонецПопытки;
	Результат=РезультатЗапроса.Выгрузить() ;
	ЭлементыФормы.ТабличноеПоле1.Значение=Результат;
	ЭлементыФормы.ТабличноеПоле1.СоздатьКолонки();
    ЭлементыФормы.КолЗаписейЗначТекст.Значение=Результат.Количество();
КонецПроцедуры

Процедура ОтметитьВсеНажатие(Элемент)
	Для каждого Реквизит Из ЭлементыФормы.ПолеСпискаРеквизитов.Значение Цикл
		Реквизит.Пометка=Истина;
	КонецЦикла;
	РезультатЗапроса=Неопределено;
КонецПроцедуры

Процедура СнятьВсеОтметкиНажатие(Элемент)
	Для каждого Реквизит Из ЭлементыФормы.ПолеСпискаРеквизитов.Значение Цикл
		Реквизит.Пометка=Ложь;
	КонецЦикла;
	РезультатЗапроса=Неопределено;
КонецПроцедуры

Процедура КнопкаВверхНажатие(Элемент)
	Попытка
		ЭлементыФормы.ПолеСпискаРеквизитов.Значение.Сдвинуть(ЭлементыФормы.ПолеСпискаРеквизитов.ТекущаяСтрока,-1);
		РезультатЗапроса=Неопределено;	
	Исключение
	КонецПопытки;
КонецПроцедуры

Процедура КнопкаВнизНажатие(Элемент)
	Попытка
		ЭлементыФормы.ПолеСпискаРеквизитов.Значение.Сдвинуть(ЭлементыФормы.ПолеСпискаРеквизитов.ТекущаяСтрока,1);
		РезультатЗапроса=Неопределено;	
	Исключение
	КонецПопытки;
КонецПроцедуры

Процедура КоманднаяПанель2ТекстФайл(Кнопка)
	ОтмеченныеРеквизиты=Новый Массив();
	Для каждого Реквизит Из ЭлементыФормы.ПолеСпискаРеквизитов.Значение Цикл
		Если Реквизит.Пометка Тогда
			ОтмеченныеРеквизиты.Добавить(Реквизит.Значение)	
		КонецЕсли;
	КонецЦикла;
	Если ОтмеченныеРеквизиты.Количество()=0 Тогда
		Предупреждение("Не отмечено ни одного реквизита!");
		Возврат;
	КонецЕсли; 
	Запрос1=Новый Запрос();
	Запрос1.Текст=ТекстЗапросаСправочники(ЭлементыФормы.ПолеВыбораСправочника.Значение, ЭлементыФормы.ПолеВыбораСортировки.Значение);
	Попытка
		РезультатЗапроса= Запрос1.Выполнить();
	Исключение
		ТекстОшибки=ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если Найти(ТекстОшибки,"Недопустимое поле для упорядочивания")<>0 Тогда
			Предупреждение("Невозможно сортировать список по выбранному реквизиту."+Символы.ПС+"Выберите другой реквизит для сортировки."); 
		КонецЕсли;
		Возврат;
	КонецПопытки;
	ФормаСохранения=ОбработкаОбъект.ПолучитьФорму("ФормаТекстФайл");
	Результат=ФормаСохранения.ОткрытьМодально();
КонецПроцедуры

Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	Если  ФлагЗакрытия Тогда
		Режим1 = РежимДиалогаВопрос.ДаНет;
		Текст = "Закончить работу обработки?";
		Ответ = Вопрос(Текст, Режим1);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
	    	Отказ=истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОсновныеДействияФормыНазад(Кнопка)   
	ФормаВыбора1=ПолучитьФорму("ФормаВыбора");
	ФормаВыбора1.Открыть();
	ФлагЗакрытия=Ложь;
	ЭтаФорма.Закрыть();
КонецПроцедуры

Процедура ПолеСпискаРеквизитовПриИзмененииФлажка(Элемент)
	РезультатЗапроса=Неопределено;
КонецПроцедуры
