
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитДляПроверкиОбщ = параметры.РеквизитДляПроверкиОбщ;
	РегистрПроводки = Параметры.РегистрПроводки;
	НазваниеСправКонтрагенты = Параметры.НазваниеСправКонтрагенты;
	
	обработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	Элементы.Декорация1.Заголовок=СтрЗаменить(Элементы.Декорация1.Заголовок, "Реквизит", РеквизитДляПроверкиОбщ);
	
	РеквизитыСписок=Новый Массив();
	
	Если НазваниеСправКонтрагенты=Неопределено тогда
		Элементы.Декорация1.Заголовок=СтрЗаменить(Элементы.Декорация1.Заголовок, "РегистрСправ", РегистрПроводки);
		РеквизитыСписок=обработкаОбъект.СформироватьРеквизитыРегистра();	
	Иначе
		Элементы.Декорация1.Заголовок=СтрЗаменить(Элементы.Декорация1.Заголовок, "РегистрСправ", НазваниеСправКонтрагенты);	
		РеквизитыСписок=СформироватьРеквизитыКонтрагентов(НазваниеСправКонтрагенты);
	КонецЕсли;
	Элементы.ПолеВвода.СписокВыбора.ЗагрузитьЗначения(РеквизитыСписок);

КонецПроцедуры

&НасервереБезКонтекста
Функция СформироватьРеквизитыКонтрагентов(НазваниеСправКонтрагенты)
	РеквизитыСписок=Новый Массив();
	МетаданныеСправКонтр=Метаданные.Справочники.Найти(НазваниеСправКонтрагенты);
	Для каждого РеквизитСсылка Из МетаданныеСправКонтр.Реквизиты  Цикл	
		РеквизитыСписок.Добавить(РеквизитСсылка.Имя);
	КонецЦикла;
	Возврат РеквизитыСписок; 
КонецФункции 

&НаКлиенте
Процедура Заменить(Команда)
	
	Если ПолеВвода="" или ПолеВвода=Неопределено Тогда
		ПоказатьПредупреждение(,"Не указано поле для замены!");
		Возврат;
	КонецЕсли;
	ЭтаФорма.Закрыть(ПолеВвода);
	
КонецПроцедуры

&НаКлиенте
Процедура Пропустить(Команда)
	
	РеквизитДляПроверкиОбщ=Неопределено;
	ЭтаФорма.Закрыть(РеквизитДляПроверкиОбщ);
	
КонецПроцедуры
