
Процедура ПриОткрытии()
	ЭлементыФормы.Надпись1.Значение=
	"1С 8.2 data extraction utility"+Символы.ПС+Символы.ПС+
	" -Выгрузка списка проводок v.4.0"+Символы.ПС+
	" -Выгрузка списка контрагентов v.3.0"+Символы.ПС+
	" -Выгрузка плана счетов v.1.0"+Символы.ПС+
	" -Выгрузка журнала регистрации v.1.0"+Символы.ПС+
	" -Пользователи НСИ v.1.2"+Символы.ПС+
	" -Выгрузка справочников v.1.0"+Символы.ПС+Символы.ПС+
	"Разработано ЗАО ""Делойт и Туш СНГ"" для выгрузки данных, необходимых для проведения аудита"+Символы.ПС+ Символы.ПС+
	"Автор: Ершенкова Ольга"+Символы.ПС+Символы.ПС+
	"© 2013";
КонецПроцедуры
