
Процедура ПриОткрытии()
	СправочникиСписок=Новый СписокЗначений();
	Для каждого СправочникСсылка Из Метаданные.Справочники Цикл
		СправочникиСписок.Добавить(СправочникСсылка.Имя);
	КонецЦикла; 	
	ЭлементыФормы.ПолеВыбораСправочника.СписокВыбора=СправочникиСписок;
КонецПроцедуры

Процедура ОсновныеДействияФормыЗаменить(Кнопка)
	Если ЭлементыФормы.ПолеВыбораСправочника.Значение="" или ЭлементыФормы.ПолеВыбораСправочника.Значение=Неопределено Тогда
		Предупреждение("Не указан справочник для замены!");
		Возврат;
	КонецЕсли;
	НазваниеСправКонтрагенты=ЭлементыФормы.ПолеВыбораСправочника.Значение;
	ЭтаФорма.Закрыть();
КонецПроцедуры

Процедура ОсновныеДействияФормыПропустить(Кнопка)
	НазваниеСправКонтрагенты=Неопределено;
	ЭтаФорма.Закрыть();
КонецПроцедуры
