
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПолеВыбораОграничителя="<пусто>";	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Если ПолеВыбораОграничителя=Неопределено Тогда
		показатьПредупреждение(,"Выберите ограничитель текста!");
		Возврат;
	ИначеЕсли ПолеВыбораОграничителя="<пусто>" Тогда 
		ТекстИнд="";
	Иначе
		ТекстИнд=ПолеВыбораОграничителя;
	КонецЕсли;
	Если ЗнакТабуляции=0 Тогда
		Разделитель=Символы.Таб;
	ИначеЕсли ЗнакТабуляции=1 Тогда 
		Разделитель=";"
	ИначеЕсли ЗнакТабуляции=2 Тогда 
		Разделитель=","
    ИначеЕсли ЗнакТабуляции=3 Тогда 
		Разделитель=" "
	ИначеЕсли ЗнакТабуляции=4 Тогда 
		Если (ПолеРазделителя="") Тогда 
			ПоказатьПредупреждение(,"Введите символ разделителя!");
			Возврат;
		КонецЕсли;
		Разделитель=ПолеРазделителя;
	КонецЕсли;
	
	СтрПараметров = новый Структура("Разделитель,ТекстИнд",Разделитель,ТекстИнд);
	ЭтотОбъект.Закрыть(СтрПараметров);
		
КонецПроцедуры